<?php
    $con = mysqli_connect("localhost", "root", "maria", "sqlDB") or die("MariaDB 접속 실패!!");
    $sql = "
    INSERT INTO userTbl VALUES 
        ('LSG', N'이승기', 1987, N'서울', '011', '11111111', 182, '2008-8-8'),
        ('KBS', N'김범수', 1979, N'경남', '011', '22222222', 173, '2012-4-4'),
        ('KKH', N'김경호', 1971, N'전남', '019', '33333333', 177, '2007-7-7'),
        ('JYP', N'조용필', 1950, N'경기', '011', '44444444', 166, '2009-4-4'),
        ('SSK', N'성시경', 1979, N'서울', NULL  , NULL      , 186, '2013-12-12'),
        ('LJB', N'임재범', 1963, N'서울', '016', '66666666', 182, '2009-9-9'),
        ('YJS', N'윤종신', 1969, N'경남', NULL  , NULL      , 170, '2005-5-5'),
        ('EJW', N'은지원', 1972, N'경북', '011', '88888888', 174, '2014-3-3'),
        ('JKW', N'조관우', 1965, N'경기', '018', '99999999', 172, '2010-10-10'),
        ('BBK', N'바비킴', 1973, N'서울', '010', '00000000', 176, '2013-5-5')
    ";
    $ret = mysqli_query($con, $sql);
    if ($ret) {
        echo "userTbl에 데이터가 성공적으로 입력됨.";
    } else {
        echo "userTbl 데이터 입력 실패!!", "<br>";
        echo "실패 원인 : ", mysqli_error($con); 
    }
    mysqli_close($con);
?>